<a href="https://colab.research.google.com/github/EvidenceN/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Evidence%20N.%20Answers_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-02 21:00:47--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.137.86
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.137.86|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  89.5MB/s    in 2.2s

2019-10-02 21:00:50 (89.5 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import pandas as pd

# **The columns I need are **
- the product column which shows me the products i want
- the add_to_cart_order column that lets me know how many times it was ordered
- the product id column which is the unique identifier that will help me with merging

In [0]:
# al = Aisles
al = pd.read_csv("aisles.csv")
print(al.shape)
al.head()
# Does not have the columns or products that i need

In [0]:
# dp = department
dp = pd.read_csv("departments.csv")
print(dp.shape)
dp.head()
# Does not have the columns or products that i need

In [16]:
# opp = order_products_prior
opp = pd.read_csv("order_products__prior.csv")
print(opp.shape)
opp.head()
# I will need product_id which is the unique identifier for merging as well as
# add_to_car_order column which lets me know how many times a particular 
# product was ordered
# but first, i need to concatenate this csv with the "prior" csv file below.

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [17]:
# opt = order_products_train
opt = pd.read_csv("order_products__train.csv")
print(opt.shape)
opt.head()
# I will need product_id which is the unique identifier for merging as well as
# add_to_car_order column which lets me know how many times a particular 
# product was ordered
# but first, i need to concatenate this csv with the "prior" csv file above.

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [18]:
# od = orders
od = pd.read_csv("orders.csv")
print(od.shape)
od.head()
# Does not have the columns or products that i need

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [29]:
# pt = products
pt = pd.read_csv("products.csv")
print(pt.shape)
pt.head()
# I will need Product_name from product csv
# I will need product_id from product csv which is the unique identifier that will help me 
# merge this dataset with another data set

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [30]:
# Concatenation of order products prior and order product train
# op = order_products which is the concatenation of product_prior and product_train
op = pd.concat([opp, opt])

print(op.shape)
op.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# The next step is to filter my "products and order_product" data set to contain
# only the products that i want to have. 
# After filtering the two data sets, then i will merge the two data sets.
# After merging the two data sets, then i will figure out how many times 
# each product was ordered by using merged_list['product_name'].value_counts.

In [46]:
# I just noticed that each product has a unique product id and is only listed
# once on the table. I am going to create a table that contains only the 
# Product names that i want. 
products_needed = pt[(pt["product_name"] == "Bag of Organic Bananas") | 
   (pt["product_name"] == "Banana") | 
   (pt["product_name"] == "Organic Strawberries") | 
   (pt["product_name"] == "Organic Baby Spinach") | 
   (pt["product_name"] == "Organic Hass Avocado") | 
   (pt["product_name"] == "Organic Avocado") | 
   (pt["product_name"] == "Large Lemon") | 
   (pt["product_name"] == "Strawberries") | 
   (pt["product_name"] == "Limes") | 
   (pt["product_name"] == "Organic Whole Milk")]

products_needed.head(10)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [61]:
# filtering the order_product data set i concatenated earlier to create a data
# set that only contains the product_id matching the product_needed data set 
# I just created above. 
# I just noticed that even though there is unique product_id for each product, 
# there are a lot of orders corresponding to each product id. this is good. 
# This is exactly what is expected. 
product_id = op[(op["product_id"] == 13176) | 
                (op["product_id"] == 16797) | 
                (op["product_id"] == 21137) | 
                (op["product_id"] == 21903) |
                (op["product_id"] == 24852) |
                (op["product_id"] == 26209) |
                (op["product_id"] == 27845) |
                (op["product_id"] == 47209) |
                (op["product_id"] == 47626) |
                (op["product_id"] == 47766)]


print(product_id.shape)
product_id.head(10)
# These products accounts for about 2.4 million orders.

(2418314, 4)

     order_id  product_id  add_to_cart_order  reordered
12          3       21903                  4          1
30          5       13176                  1          1
51          5       47209                 22          0
77         10       24852                  1          1
80         10       47766                  4          1
83         10       21137                  7          1
126        14       27845                  2          1
170        18       47766                 27          1
180        20       24852                  6          0
190        22       24852                  3          1

In [0]:
# Now it is time to merge product_id and products_need using product_id as the 
# Unique identifier. 

# create the columns i want to extract from products_needed subset data

condition = ((pt["product_name"] == "Bag of Organic Bananas") | 
             (pt["product_name"] == "Banana") | 
             (pt["product_name"] == "Organic Strawberries") | 
             (pt["product_name"] == "Organic Baby Spinach") | 
             (pt["product_name"] == "Organic Hass Avocado") | 
             (pt["product_name"] == "Organic Avocado") | 
             (pt["product_name"] == "Large Lemon") | 
             (pt["product_name"] == "Strawberries") | 
             (pt["product_name"] == "Limes") | 
             (pt["product_name"] == "Organic Whole Milk"))

products_needed_column = ['product_id', 'product_name']

In [70]:
product_subset = pt.loc[condition, products_needed_column]
product_subset.head()

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana

In [73]:
# create the columns i want to extract from product_id subset data
product_id_column = ["order_id", 'product_id', 'add_to_cart_order']

condition = ((op["product_id"] == 13176) | 
                (op["product_id"] == 16797) | 
                (op["product_id"] == 21137) | 
                (op["product_id"] == 21903) |
                (op["product_id"] == 24852) |
                (op["product_id"] == 26209) |
                (op["product_id"] == 27845) |
                (op["product_id"] == 47209) |
                (op["product_id"] == 47626) |
                (op["product_id"] == 47766))

id_subset = op.loc[condition, product_id_column]
id_subset.head()

    order_id  product_id  add_to_cart_order
12         3       21903                  4
30         5       13176                  1
51         5       47209                 22
77        10       24852                  1
80        10       47766                  4

In [121]:
# Time for the merge magic

merged = pd.merge(product_subset, id_subset, how='inner', on="product_id")

print(merged.shape)
merged.head()

(2418314, 4)

   product_id            product_name  order_id  add_to_cart_order
0       13176  Bag of Organic Bananas         5                  1
1       13176  Bag of Organic Bananas        27                  1
2       13176  Bag of Organic Bananas        29                  3
3       13176  Bag of Organic Bananas        32                  3
4       13176  Bag of Organic Bananas        42                  3

In [122]:
# Now the glorious time to figure out how many orders for each item.

# This is how many times the top 10 most frequently ordered products was ordered
merged['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [0]:
merged.sort_values(by="add_to_cart_order")[:10]

In [0]:
# Replicate the code cells before shape data section
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)
display(example)

aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

display(example)

order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

orders = pd.read_csv('orders.csv')

print(orders.shape)

orders.head()

products = pd.read_csv('products.csv')
print(products.shape)
products.head()

order_products__prior.shape

order_products__train.shape

order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)

order_products.head(50)

assert 1 == 1
# assert 1 == 0
assert (order_products__prior.shape[0] + order_products__train.shape[0]== order_products.shape[0])

display(example)

(order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795) 

order_products[(order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)].head(20)

orders[orders['user_id'] == 1][orders['order_number'] <= 2]

condition = (orders['user_id'] == 1) & (orders['order_number'] <= 2)

columns = ['user_id', 
           'order_id', 
           'order_number', 
           'order_dow', 
           'order_hour_of_day'
           ]

orders_subset = orders.loc[condition, columns]
orders_subset.head()

condition = (order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)

columns = ['order_id', 
           'add_to_cart_order', 
           'product_id'
           ]

order_products_subset = order_products.loc[condition, columns]
order_products_subset.head(20)

merged = pd.merge(orders_subset, order_products_subset, how='inner', on='order_id')

merged.head()

display(example)

final = pd.merge(merged, products[['product_id', 'product_name']], how='inner', on='product_id')
final.head(11)

display(example)

final = final.sort_values(by=['order_number', 'add_to_cart_order'])
final

final.columns = [column.replace('_', ' ') for column in final]
final

display(example)

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Complete the code cells we skipped near the beginning of the notebook

# We didnt' skip any code cells near the beginning of the notebook.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16, 11],
     [3, 1]], 
     index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
     columns = ['treatmenta', 'treatmentb']
)

table2=table1.T

In [0]:
flights = sns.load_dataset('flights')

In [0]:
table1

In [96]:
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [92]:
# Table 2 --> Tidy
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [103]:
tidy=table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [106]:
# Tidy --> Table 2
wide = tidy.pivot_table(index="index", values='value', columns='variable')

wide

variable    Jane Doe  John Smith  Mary Johnson
index
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [109]:
# flights pivot table
flights[:10]

   year      month  passengers
0  1949    January         112
1  1949   February         118
2  1949      March         132
3  1949      April         129
4  1949        May         121
5  1949       June         135
6  1949       July         148
7  1949     August         148
8  1949  September         136
9  1949    October         119

In [112]:
'''Then create a pivot table showing the number of passengers by month and year. 
Use year for the index and month for the columns. You've done it right if you 
get 112 passengers for January 1949 and 432 passengers for December 1960.'''

flights_pivot = flights.pivot_table(index='year', columns='month', values='passengers')
print(flights_pivot.shape)
flights_pivot

(12, 12)

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

In [119]:
# Replicate code cells after shape data section. 
table1

table2

table1.columns.tolist()

table1.index.tolist()

table1

table1 = table1.reset_index()
table1

tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy

tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

wide = tidy.pivot_table(index='name', columns='trt', values='result')
wide

import seaborn as sns

sns.catplot(x='trt', y='result', col='name', 
            kind='bar', data=tidy, height=4);

products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

products.columns.to_list()

orders.columns.to_list()

order_products.columns.to_list()

merged = (products[['product_id', 'product_name']]
          .merge(order_products[['order_id', 'product_id']])
          .merge(orders[['order_id', 'order_hour_of_day']]))

merged.head()

condition = ((merged['product_name']=='Half Baked Frozen Yogurt') | 
             (merged['product_name']=='Half And Half Ultra Pasteurized'))

merged = merged[condition]

print(merged.shape)
merged.head()

product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

condition = merged['product_name'].isin(product_names)

subset = merged[condition]

print(subset.shape)
subset.head()

froyo = subset[subset['product_name']=='Half Baked Frozen Yogurt']
cream = subset[subset['product_name']=='Half And Half Ultra Pasteurized']

cream['order_hour_of_day'].value_counts(normalize=True).sort_index()

(cream['order_hour_of_day']
 .value_counts(normalize=True)
 .sort_index()
 .plot())

(froyo['order_hour_of_day']
 .value_counts(normalize=True)
 .sort_index()
 .plot());

 pd.crosstab(subset['order_hour_of_day'], 
            subset['product_name'], 
            normalize='columns').plot();

subset.pivot_table(index='order_hour_of_day', 
                   columns='product_name', 
                   values='order_id', 
                   aggfunc=len).plot();

table = pd.crosstab(subset['order_hour_of_day'], 
                    subset['product_name'], 
                    normalize=True)

table

melted = table.reset_index().melt(id_vars='order_hour_of_day').rename(columns={
     'order_hour_of_day': 'Hour of Day Ordered', 
     'product_name': 'Product', 
     'value': 'Percent of Orders by Product'
 })

melted

sns.relplot(x='Hour of Day Ordered', 
            y='Percent of Orders by Product', 
            hue='Product', 
            data=melted, 
            kind='line');

['John Smith', 'Jane Doe', 'Mary Johnson']

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####